Tekla Open API Reference for Tekla Structures 2025
ControlPolycurve.Geometry Property
 Gets or sets geometry list that defines geometry of the polycurve.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polycurve Geometry { get; set; }
Public Property Geometry As Polycurve
	Get
	Set
Property Value
Type: Polycurve
See Also
Reference
ControlPolycurve Class
Tekla.Structures.Model Namespace